app.factory('northCharatureDetail', () => {
    var north = [{
        name: "白鱗",
        img: 'Img/north00-master.png',
        discrip: `
北災禍主，噬神種年獸，鱗片為白色，\n
賭性堅強，而且賭技跟運氣都不錯，\n
原本的領地只有台北湖一代，靠著賭博從其他災禍手上贏下新竹以北\n
懶惰的代名詞，然而一但被迫勤勞，也是有領袖的一面，\n
曾在北宋時期闖天宮，數年報復性的獵殺玉帝以及各路位高權重的仙官，\n
造成天庭強制徵招有仙骨的凡人組成『零期仙班』以應付不足的人手，\n
清末，接受謝誓鳴的交換條件，用不獵殺台灣仙換取大稻埕的興起。\n
        災保區為 大安 松山 信義區\n
        `,
    }, {
        name: "鴉青",
        img: 'Img/north02-yachin.png',
        discrip: `
北災禍主第二候補，擺盪種年獸，鱗片為鴉青色，\n
和另外兩個黃眸年相比，行事比較保守，
性格使然，苦命角擔當，負責照顧白鱗的起居，\n
`,
    }, {
        name: "藕荷",
        img: 'Img/north01-yachin.png',
        discrip: `
北災禍第一候補，擺盪種年獸，鱗片為藕荷色，\n
和鴉清為雙子兄妹，但力量比較強，\n
性格較接近白鱗，鴉青勞碌的來源之一。\n
`,
    }, {
        name: "謝誓鳴",
        img: 'Img/north-hsies.png',
        discrip: `
零期仙班出身，官位城隍。\n
人手不足而讓當代官位指派只看能力不看背景，\n
即便是女性也有機會擔任城隍，\n
出身宋代商賈之家，善經商，人稱謝商隍，\n
而隨著任職區的改變，陸續撐起了一府二鹿三艋舺。\n
二二八後，所有資產皆被充公，逃入災保區才免於劫難，\n
後與白鱗借錢東山再起，現於松山城隍廟任城隍一職\n
        
        `,
    }, {
        name: "席良名",
        img: 'Img/north-shi.png',
        discrip: `
桂仙籍，民國後入仙班，台北省城隍。\n  
僅修仙三年就擔任省級城隍，\n
本要在家鄉任職，無奈省城隍廟因種種原因而被拆毀，\n
轉而被指派往台北省城隍廟任職，\n
和當代其他唐山仙相比，對台灣人比較友善，\n
甚至為了理想中的和平未來而擅闖災禍主會議談和，\n
因此被其他唐山仙視為叛徒而被拖出城隍廟痛毆\n
，讓還是半仙的他差點死於非命，\n
後雖救回，但聽力受損，台灣三大省級城隍之一\n
        
        `,
    }, {
        name: "趙凜德",
        img: 'Img/north06-du.png',
        discrip: `
零期仙班出身，官位城隍。\n
出生帝王之家但母親是棄妃，善交際與談判，\n
曾欺騙鴉青讓他保護字，\n
曾在府城隍被換下時，保住了自己和臺灣仙的官位，\n
現於新竹都城隍廟任職，\n
台灣三大省級城隍之一，北災禍主第六候補\n
        
        `,
    }, {
        name: "李正成",
        img: 'Img/north03-lee.png',
        discrip: `
物妖，正成牌腳踏車，北災禍第三候補，生於四六事件，\n
那天輪軸斷裂被藏於儲藏室，造成後續腳踏車共乘事件，\n
後因劫囚而歸類為災禍。\n
繼承台大師大菁英的記憶，和其他神話生物相比，會很多人類技術，\n
因事件中，菁菁學子不問血緣地緣共同對抗國民政府，\n
而且唐山出身的台大校長保護學生，台灣出身的師大校長則放任軍官抓人，\n
和其他白色年代物妖相比，省籍情結沒有那麼重，
現於T大醫院擔任醫師
        `,
    }, {
        name: "陳緝示",
        img: 'Img/north16-chan.png',
        discrip: `
物妖，日本警刀，北災禍第十六候補，生於基隆大屠殺，\n
其主陳緝示為了爭取市民安全，隻身對抗了拿槍的官兵，\n
魂魄堅毅引起警刀的共鳴，\n
除了核心外，也繼承了當代罹難者的記憶，\n
因被用來攻擊當代政權，不問緣由就歸類為災禍\n
現於基隆港警察總隊以及神話警察部隊擔任刑警\n
        `,
    },
    {
        name: "初響",
        img: 'Img/north19-cu.png',
        discrip: `
物妖，二二八事件，用來掃射抗議民眾的槍，北災禍第十九候補，
因為造成多人死亡，歸類為災禍，
不過情感與記憶來自槍口那一邊，
        `,
    }, {
        name: "雅提",
        img: 'Img/north09-yati.png',
        discrip: `
物妖，電腦，目前台灣最新的物妖，\n
擔任南港、文山、內湖一帶的城隍\n
`,
    },
    {
        name: "羨魚",
        img: 'Img/north17-envy.png',
        discrip: `
大白鷺妖，自認守護對象是非人生物，\n
擔任北投、士林區城隍，北災禍十七候補\n
`,
    },]
    return north;
}
)